package java_rush.cycles_l4;

//Вывести на экран числа от 1 до 10 включительно, используя цикл while. Каждое значение с новой строки.
public class L10 {
    public static void main(String[] args) {
        /*int i = 0;
        while (i < 10) {
            i++;
            System.out.println(i);*/
        int i = 1;
        while (i <= 10) {
            System.out.println(i);
            i++;
        }
    }
}
