package java_rush.cycles_l4;

//Вывести на экран числа от 10 до 1 включительно, используя цикл while. Каждое значение с новой строки.
public class L10Minus {
    public static void main(String[] args) {
        /*int i = 11;
        while (i > 1) {
           i--;
            System.out.println(i);
        }*/
        int i = 10;
        while (i >= 1) {
            System.out.println(i);
            i--;
        }
    }
}
